# Part Two: File Analysis

In [1]:
import pandas as pd

## 1.Read the file `2017_jun_final.csv` using the `read_csv` method.

In [2]:
df = pd.read_csv("2017_jun_final - 2017_jun_final.csv")

## 2. Display the first rows of the table using the `head` method.

In [3]:
df.head()

,N,Role,Programming language,Specialisation,Experience,Experience on current job,Salary/month,Изменение.зарплаты.за.12.месяцев,City,Company size,...,Still student,English,Subject.area,Date,User.Agent,exp,current_job_exp,salary,Валюта,cls
0,1,Junior QA engineer,NaN,Manual QA,0.5,0.5,400,0,New York,up to 10 employees,...,True,A1,"iOS,eCommerce",12/06/2017 12:38:08,Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...,0.5,0.5,400,NaN,QA
1,2,Junior QA engineer,NaN,Manual QA,loss then 3 month,loss then 3 month,430,130,New York,more then 1000 employees,...,True,B2,Web development,12/06/2017 12:42:51,Mozilla/5.0 (iPad; CPU OS 10_2_1 like Mac OS X...,0.0,0.0,430,NaN,QA
2,3,Software Engineer,C#/.NET,NaN,4,1,2500,800,Berlin,up to 1000 employees,...,False,B1,"Web development,Corporative systems",12/06/2017 13:02:47,Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...,4.0,1.0,2500,NaN,DEV
3,4,Software Engineer,JavaScript,NaN,5,4,2000,400,Odesa,up to 200 employees,...,False,A1,"Desktop Applications,Web development",12/06/2017 13:03:01,Mozilla/5.0 (Windows NT 6.1; Win64; x64) Apple...,5.0,4.0,2000,NaN,DEV
4,5,Senior Software Engineer,JavaScript,NaN,10+,0.5,4500,500,Other,up to 10 employees,...,False,B1,"Desktop Applications,Web development",12/06/2017 13:03:47,Mozilla/5.0 (iPhone; CPU iPhone OS 10_3_2 like...,10.0,0.5,4500,NaN,DEV

## 3. Define the size of the table using the `shape` method.

In [4]:
df.shape

(8704, 25)

## 4. Define the types of all columns using the `dataframe.dtypes` method.

In [5]:
df.dtypes

N                                     int64
Role                                 object
Programming language                 object
Specialisation                       object
Experience                           object
Experience on current job            object
Salary/month                          int64
Изменение.зарплаты.за.12.месяцев      int64
City                                 object
Company size                         object
Company type                         object
Gender                               object
Age                                   int64
Education                            object
University                           object
Still student                          bool
English                              object
Subject.area                         object
Date                                 object
User.Agent                           object
exp                                 float64
current_job_exp                     float64
salary                                int64
Валюта                               object
cls                                  object
dtype: object

## 5. Calculate the proportion of empty spaces in each column (use `isnull` and `sum` methods).

In [6]:
df.isnull().sum() / len(df)

N                                   0.000000
Role                                0.000000
Programming language                0.442325
Specialisation                      0.829389
Experience                          0.000000
Experience on current job           0.000000
Salary/month                        0.000000
Изменение.зарплаты.за.12.месяцев    0.000000
City                                0.000000
Company size                        0.000000
Company type                        0.000000
Gender                              0.000000
Age                                 0.000000
Education                           0.000000
University                          0.177619
Still student                       0.000000
English                             0.000000
Subject.area                        0.025620
Date                                0.000000
User.Agent                          0.000000
exp                                 0.000000
current_job_exp                     0.000000
salary                              0.000000
Валюта                              0.998851
cls                                 0.180836
dtype: float64

## 6. Remove all columns with spaces except for the "Programming Language" column.

In [7]:
for col in df.columns:
  if " " in col and col != "Programming language":
    df.drop(col, axis=1, inplace=True)

## 7. Recount the percentage of empty spaces in each column and ensure only the "Programming Language" column remains.

In [8]:
df.isnull().sum() / len(df)

N                                   0.000000
Role                                0.000000
Programming language                0.442325
Salary/month                        0.000000
Изменение.зарплаты.за.12.месяцев    0.000000
City                                0.000000
Gender                              0.000000
Age                                 0.000000
Education                           0.000000
University                          0.177619
Subject.area                        0.025620
Date                                0.000000
User.Agent                          0.000000
exp                                 0.000000
current_job_exp                     0.000000
salary                              0.000000
Валюта                              0.998851
cls                                 0.180836
dtype: float64

## 8. Remove all rows from the original table using the `dropna` method.

In [9]:
df = df.dropna()

## 9. Define the new size of the table using the `shape` method.

In [10]:
df.shape

(8, 18)

## 10. Create a new table `python_data` containing only rows with specialists who listed Python as a programming language.

In [11]:
python_data = pd.read_csv("2017_jun_final - 2017_jun_final.csv")
python_data = python_data[python_data["Programming language"] == "Python"]
python_data

,N,Role,Programming language,Specialisation,Experience,Experience on current job,Salary/month,Изменение.зарплаты.за.12.месяцев,City,Company size,...,Still student,English,Subject.area,Date,User.Agent,exp,current_job_exp,salary,Валюта,cls
12,13,Software Engineer,Python,NaN,1,loss then 3 month,800,200,Berlin,up to 50 employees,...,False,A1,"Web development,Other",12/06/2017 13:05:54,Mozilla/5.0 (Windows NT 6.1; Win64; x64) Apple...,1.0,0.0,800,NaN,DEV
68,69,Software Engineer,Python,NaN,1.5,0.5,900,900,Berlin,up to 10 employees,...,True,B2,Web development,12/06/2017 13:11:17,Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...,1.5,0.5,900,NaN,DEV
87,88,Junior Software Engineer,Python,NaN,0.5,0.5,600,0,Berlin,up to 10 employees,...,True,B2,"Web development,eCommerce",12/06/2017 13:12:25,Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/53...,0.5,0.5,600,NaN,DEV
114,115,Junior Software Engineer,Python,NaN,1.5,0.5,685,250,Berlin,up to 1000 employees,...,False,B1,Other,12/06/2017 13:14:52,Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/53...,1.5,0.5,685,NaN,DEV
143,144,Junior Software Engineer,Python,NaN,1,1,750,250,Berlin,up to 10 employees,...,True,B2,Web development,12/06/2017 13:19:10,Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/53...,1.0,1.0,750,NaN,DEV
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8546,8547,Software Engineer,Python,NaN,5,1,2000,800,Łódź,up to 50 employees,...,False,B1,Web development,10/07/2017 14:11:26,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_12_5...,5.0,1.0,2000,NaN,DEV
8625,8626,Software Engineer,Python,NaN,4,1,1750,0,Berlin,more then 1000 employees,...,False,B1,Web development,11/07/2017 16:15:40,Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:54....,4.0,1.0,1750,NaN,DEV
8635,8636,Senior Software Engineer,Python,NaN,10+,loss then 3 month,4000,1300,Remote,up to 10 employees,...,False,B2,Web development,11/07/2017 17:51:36,Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/53...,10.0,0.0,4000,NaN,DEV
8673,8674,Junior Software Engineer,Python,NaN,0.5,0.5,350,50,Berlin,up to 50 employees,...,False,B1,Web development,12/07/2017 9:37:16,Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:54....,0.5,0.5,350,NaN,DEV
8695,8696,Software Engineer,Python,NaN,1,0.5,1500,1000,Berlin,up to 10 employees,...,False,B1,"Finance,eCommerce",12/07/2017 14:39:21,Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/53...,1.0,0.5,1500,NaN,DEV

## 11. Define the size of the `python_data` table using the `shape` method.

In [12]:
python_data.shape

(207, 25)

## 12. Using the [groupby](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html) method, group by the "Role" column.

In [13]:
groupby_data = python_data.groupby('Role')

## 13. Create a new DataFrame where, for data grouped by the "Role" column, you perform data aggregation using the [agg](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.agg.html) method and find the minimum and maximum values in the "Monthly Salary" column.

In [14]:
grouped_data = groupby_data.agg({'Salary/month': ['min', 'max']})
grouped_data

                         Salary/month
                                  min   max
Role
Junior Software Engineer          100  1250
Senior Software Engineer         1300  9200
Software Engineer                 500  5400
System Architect                 3000  5000
Technical Lead                   1425  6200

## 14. Create a function `fill_avg_salary` that returns the average monthly salary. Use it in the [apply](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html) method to create a new column "avg".

In [15]:
def fill_avg_salary(row):
  return (row["Salary/month"]["min"] + row["Salary/month"]["max"])/2

grouped_data['avg'] = grouped_data.apply(fill_avg_salary, axis=1)

grouped_data

                         Salary/month           avg
                                  min   max
Role
Junior Software Engineer          100  1250   675.0
Senior Software Engineer         1300  9200  5250.0
Software Engineer                 500  5400  2950.0
System Architect                 3000  5000  4000.0
Technical Lead                   1425  6200  3812.5

## 15. Create descriptive statistics using the `describe` method for the new column.

In [16]:
grouped_data['avg'].describe()

count       5.000000
mean     3337.500000
std      1700.091909
min       675.000000
25%      2950.000000
50%      3812.500000
75%      4000.000000
max      5250.000000
Name: avg, dtype: float64

## 16. Save the resulting table to a CSV file.

In [17]:
grouped_data.to_csv("grouped_data.csv")